---
kind: method
id: M:Autodesk.Revit.DB.CancellationListener.Dispose
source: html/6869bfa1-909c-301d-4224-71fd681a1da3.htm
---
# Autodesk.Revit.DB.CancellationListener.Dispose Method

Releases all resources used by the CancellationListener

## Syntax (C#)
```csharp
public void Dispose()
```